# Preparing data

### Reading DataFrames from multiple files in a loop

In [1]:
import pandas as pd

In [2]:
filenames = ['summer_olympic_medals/Silver.csv', 'summer_olympic_medals/Bronze.csv', 'summer_olympic_medals/Gold.csv']
dataframes = []

In [3]:
for filename in filenames:
    dataframes.append(pd.read_csv(filename))
    
dataframes[1].head()

   NOC         Country   Total
0  USA   United States  1052.0
1  URS    Soviet Union   584.0
2  GBR  United Kingdom   505.0
3  FRA          France   475.0
4  GER         Germany   454.0

### Combining DataFrames from multiple data files

In [4]:
medals = dataframes[2].copy()
new_labels = ['NOC', 'Country', 'Gold']
medals.columns = new_labels

In [5]:
medals['Silver'] = dataframes[0]['Total']
medals['Bronze'] = dataframes[1]['Total']
medals.head()

   NOC         Country    Gold  Silver  Bronze
0  USA   United States  2088.0  1195.0  1052.0
1  URS    Soviet Union   838.0   627.0   584.0
2  GBR  United Kingdom   498.0   591.0   505.0
3  FRA          France   378.0   461.0   475.0
4  GER         Germany   407.0   350.0   454.0

### Reindexing DataFrame from a list

In [17]:
weather_dict = {
    'Month':['Apr', 'Jan', 'Jul', 'Oct'],
    'Mean TemperatureF':[61.956044, 32.133333, 68.934783, 43.434783]
}
weather = pd.DataFrame(weather_dict)
weather = weather.set_index('Month')
weather

       Mean TemperatureF
Month
Apr            61.956044
Jan            32.133333
Jul            68.934783
Oct            43.434783

In [18]:
year = ['Jan',
 'Feb',
 'Mar',
 'Apr',
 'May',
 'Jun',
 'Jul',
 'Aug',
 'Sep',
 'Oct',
 'Nov',
 'Dec']

In [20]:
weather2 = weather.reindex(year)
weather2

       Mean TemperatureF
Month
Jan            32.133333
Feb                  NaN
Mar                  NaN
Apr            61.956044
May                  NaN
Jun                  NaN
Jul            68.934783
Aug                  NaN
Sep                  NaN
Oct            43.434783
Nov                  NaN
Dec                  NaN

In [21]:
weather3 = weather.reindex(year).ffill()
weather3

       Mean TemperatureF
Month
Jan            32.133333
Feb            32.133333
Mar            32.133333
Apr            61.956044
May            61.956044
Jun            61.956044
Jul            68.934783
Aug            68.934783
Sep            68.934783
Oct            43.434783
Nov            43.434783
Dec            43.434783